#### <div style="color:#0077b6; text-align:right">NAME : SANJHI JAIN</div>
#### <div style="color:#0077b6; text-align:right">ROLL NO : CSC/21/19</div>

## <span style="color:#4a4e69">PRACTICAL 08 </span>

#### <span style="color:#007f5f">8.Consider the following data frame containing a family name,gender of the family member and her/his monthly income in each record.</span>

<table>
    <tr>
        <th>Name</th>
        <th>Gender</th>
        <th>MonthlyIncome(Rs.)</th>
    </tr>
    <tr>
        <td>Shah</td>
        <td>Male</td>
        <td>114000.00</td>
    </tr>
    <tr>
        <td>Vats</td>
        <td>Male</td>
        <td>65000.00</td>
    </tr>
    <tr>
        <td>Vats</td>
        <td>Female</td>
        <td>43150.00</td>
    </tr>
    <tr>
        <td>Kumar</td>
        <td>Female</td>
        <td>69500.00</td>
    </tr>
    <tr>
        <td>Vats</td>
        <td>Female</td>
        <td>155000.00</td>
    </tr>
    <tr>
        <td>Kumar</td>
        <td>Male</td>
        <td>103000.00</td>
    </tr>
    <tr>
        <td>Shah</td>
        <td>Male</td>
        <td>55000.00</td>
    </tr>
    <tr>
        <td>Shah</td>
        <td>Female</td>
        <td>112400.00</td>
    </tr>
    <tr>
        <td>Kumar</td>
        <td>Female</td>
        <td>81030.00</td>
    </tr>
    <tr>
        <td>Vats</td>
        <td>Male</td>
        <td>71900.00</td>
    </tr>
</table>

In [1]:
# importing numpy  library
# importing pandas library
import numpy as np
import pandas as pd

In [2]:
#loading dataset into dataframe
data = {
    'Name': ['Shah', 'Vats', 'Vats', 'Kumar', 'Vats', 'Kumar', 'Shah', 'Shah', 'Kumar', 'Vats'],
    'Gender': ['Male', 'Male', 'Female', 'Female', 'Female', 'Male', 'Male', 'Female', 'Female', 'Male'],
    'MonthlyIncome': [114000.00, 65000.00, 43150.00, 69500.00, 155000.00, 103000.00, 55000.00, 112400.00, 81030.00, 71900.00]
}
df = pd.DataFrame(data)
df

    Name  Gender  MonthlyIncome
0   Shah    Male       114000.0
1   Vats    Male        65000.0
2   Vats  Female        43150.0
3  Kumar  Female        69500.0
4   Vats  Female       155000.0
5  Kumar    Male       103000.0
6   Shah    Male        55000.0
7   Shah  Female       112400.0
8  Kumar  Female        81030.0
9   Vats    Male        71900.0

##### <span style="color:#003f88">a. Calculate and display familywise gross monthly income</span>

In [3]:
familywise_income = df.groupby('Name')['MonthlyIncome'].sum()
print("Familywise Gross Monthly Income:")
print(familywise_income)

Familywise Gross Monthly Income:
Name
Kumar    253530.0
Shah     281400.0
Vats     335050.0
Name: MonthlyIncome, dtype: float64

##### <span style="color:#003f88">b. Calculate and display the member with the highest monthly income in a family</span>

In [4]:
max_income_member = df.groupby('Name')['MonthlyIncome'].idxmax()
# print(max_income_member) #store the index of max income in a family
highest_income_members = df.loc[max_income_member]
print("Member with Highest Monthly Income in Each Family:")
print(highest_income_members)

Member with Highest Monthly Income in Each Family:
    Name  Gender  MonthlyIncome
5  Kumar    Male       103000.0
0   Shah    Male       114000.0
4   Vats  Female       155000.0

##### <span style="color:#003f88">c. Calculate and display monthly income of all members with income greater than Rs.60000.00</span>

In [5]:
high_income_members = df[df['MonthlyIncome'] > 60000.00]
print("Monthly Income of Members with Income > Rs. 60000.00:")
print(high_income_members[['Name', 'MonthlyIncome']])

Monthly Income of Members with Income > Rs. 60000.00:
    Name  MonthlyIncome
0   Shah       114000.0
1   Vats        65000.0
3  Kumar        69500.0
4   Vats       155000.0
5  Kumar       103000.0
7   Shah       112400.0
8  Kumar        81030.0
9   Vats        71900.0

##### <span style="color:#003f88">d. Calculate and display the average monthly income of the female members in the Shah family</span>

In [6]:
shah_female_avg_income = df[(df['Name'] == 'Shah') & (df['Gender'] =='Female')]['MonthlyIncome'].mean()
print("Average Monthly Income of Female Members in Shah Family:",shah_female_avg_income)

Average Monthly Income of Female Members in Shah Family: 112400.0